#!/usr/bin/env python3
from checkmate import checkmate

def main():
#กระดานเป็น 8x8 (list of lists)
    board = [
        ['.', '.', '.', '.', '.', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.', '.', '.'],
        ['.', '.', '.', 'K', '.', '.', '.', '.'],
        ['.', '.', '.', '.', 'P', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.', '.', '.']
    ]
#เรียกใช้ฟังก์ชัน
    result = checkmate(board)
    print(result)

if __name__ == "__main__":
    main()